GabyGold67/ButtonToSwitch_STM32/src/mpbToSwitchSTM32.cpp
/*
 * @file		: mpbToSwitchSTM32.cpp
 * @brief	: Header file for
 *
 * @author	: Gabriel D. Goldman
 * @date		: Created on: Nov 6, 2023
 */

#include "mpbToSwitchSTM32.h"

DbncdMPBttn::DbncdMPBttn()
:_mpbttnPort{NULL}, _mpbttnPin{0}, _pulledUp{true}, _typeNO{true}, _dbncTimeOrigSett{0}
{
}

DbncdMPBttn::DbncdMPBttn(GPIO_TypeDef* mpbttnPort, const uint16_t &mpbttnPin, const bool &pulledUp, const bool &typeNO, const unsigned long int &dbncTimeOrigSett)
: _mpbttnPort{mpbttnPort}, _mpbttnPin{mpbttnPin}, _pulledUp{pulledUp}, _typeNO{typeNO}, _dbncTimeOrigSett{dbncTimeOrigSett}
{
    char mpbttnPinChar[3]{};
    int tmpBitCount{0};
    uint16_t tmpPinNum {_mpbttnPin};

    tmpPinNum = tmpPinNum >> 1;
    while(tmpPinNum > 0){
   	 tmpPinNum = tmpPinNum >> 1;
   	 ++tmpBitCount;
    }
    sprintf(mpbttnPinChar, "%02u", tmpBitCount);
    strcpy(_mpbPollTmrName, "PollMpbPin");
    if(mpbttnPort == GPIOA)
    	strcat(_mpbPollTmrName, "A");
    else if(mpbttnPort == GPIOB)
    	strcat(_mpbPollTmrName, "B");
    else if(mpbttnPort == GPIOC)
    	strcat(_mpbPollTmrName, "C");
    else if(mpbttnPort == GPIOD)
    	strcat(_mpbPollTmrName, "D");
    else if(mpbttnPort == GPIOE)
    	strcat(_mpbPollTmrName, "E");
#ifdef GPIOF
    else if(mpbttnPort == GPIOF)	//Port not present in all STM32 MCUs/DevBoards
    	strcat(_mpbPollTmrName, "F");
#endif
#ifdef GPIOG
    else if(mpbttnPort == GPIOG)	//Port not present in all STM32 MCUs/DevBoards
    	strcat(_mpbPollTmrName, "G");
#endif
#ifdef GPIOH
    else if(mpbttnPort == GPIOH)	//Port not present in all STM32 MCUs/DevBoards
    	strcat(_mpbPollTmrName, "H");
#endif
#ifdef GPIOI
    else if(mpbttnPort == GPIOI)	//Port not present in all STM32 MCUs/DevBoards
    	strcat(_mpbPollTmrName, "I");
#endif
    strcat(_mpbPollTmrName, mpbttnPinChar);
    strcat(_mpbPollTmrName, "_tmr");

    if(_dbncTimeOrigSett < _stdMinDbncTime) 	// Best practice would impose failing the constructor (throwing an exception or building a "zombie" object)
        _dbncTimeOrigSett = _stdMinDbncTime;    //this tolerant approach taken for developers benefit, but object will be no faithful to the instantiation parameters
    _dbncTimeTempSett = _dbncTimeOrigSett;

    if(mpbttnPin > 0){
    	if(mpbttnPort == GPIOA)
			__HAL_RCC_GPIOA_CLK_ENABLE();	//Sets the bit in the GPIO enabled clocks register, by logic OR of the corresponding bit, no problem if already set, macro adds time to get the clk running
		else if(mpbttnPort == GPIOB)
			__HAL_RCC_GPIOB_CLK_ENABLE();
		else if(mpbttnPort == GPIOC)
			__HAL_RCC_GPIOC_CLK_ENABLE();
		else if(mpbttnPort == GPIOD)
			__HAL_RCC_GPIOD_CLK_ENABLE();
		else if(mpbttnPort == GPIOE)
			__HAL_RCC_GPIOE_CLK_ENABLE();
#ifdef GPIOF
		else if(mpbttnPort == GPIOF)
			__HAL_RCC_GPIOF_CLK_ENABLE();	//Port not present in all STM32 MCUs/DevBoards
#endif
#ifdef GPIOG
		else if(mpbttnPort == GPIOG)
			__HAL_RCC_GPIOG_CLK_ENABLE();	//Port not present in all STM32 MCUs/DevBoards
#endif
#ifdef GPIOH
		else if(mpbttnPort == GPIOH)
			__HAL_RCC_GPIOH_CLK_ENABLE();	//Port not present in all STM32 MCUs/DevBoards
#endif
#ifdef GPIOI
		else if(mpbttnPort == GPIOI)
			__HAL_RCC_GPIOI_CLK_ENABLE();	//Port not present in all STM32 MCUs/DevBoards
#endif

		/*Configure GPIO pin : _mpbttnPin */
      HAL_GPIO_WritePin(_mpbttnPort, _mpbttnPin, GPIO_PIN_RESET);

      GPIO_InitTypeDef GPIO_InitStruct {0};

      GPIO_InitStruct.Pin = _mpbttnPin;
		GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
		GPIO_InitStruct.Pull = (_pulledUp == true)?GPIO_PULLUP:GPIO_PULLDOWN;
		HAL_GPIO_Init(_mpbttnPort, &GPIO_InitStruct);
    }
}

DbncdMPBttn::~DbncdMPBttn() {

	// Stop the refreshing timer:
	end();
	// De-initialize the GPIOx peripheral registers to their default reset values
	HAL_GPIO_DeInit(_mpbttnPort, _mpbttnPin);
	// Disable the GPIOx_CLK:
	//	__HAL_RCC_GPIOx_CLK_DISABLE ();
	//(RCC->AHB1ENR &= ~(RCC_AHB1ENR_GPIOxEN))   //Beware, just disabling the bit corresponding to one pin

}

bool DbncdMPBttn::begin(const unsigned long int &pollDelayMs) {
    bool result {false};
    BaseType_t tmrModResult {pdFAIL};

    if (pollDelayMs > 0){
        if (!_mpbPollTmrHndl){
            _mpbPollTmrHndl = xTimerCreate(
                _mpbPollTmrName,  //Timer name
                pdMS_TO_TICKS(pollDelayMs),  //Timer period in ticks
                pdTRUE,     //Auto-reload true
                this,       //TimerID: data passed to the callback function to work
                DbncdMPBttn::mpbPollCallback	  //Callback function
				);
            if (_mpbPollTmrHndl != NULL){
               tmrModResult = xTimerStart(_mpbPollTmrHndl, portMAX_DELAY);
            	if (tmrModResult == pdPASS)
                  result = true;
            }
        }

    }

    return result;
}

void DbncdMPBttn::clrStatus(){
	/*To Resume operations after a pause() without risking generating false "Valid presses" and "On" situations,
	several attributes must be reseted to "Start" values*/
	_isPressed = false;
	_isOn = false;
	_validPressPend = false;
	_dbncTimerStrt = 0;

	return;
}

const unsigned long int DbncdMPBttn::getCurDbncTime() const{

    return _dbncTimeTempSett;
}

const bool DbncdMPBttn::getIsOn() const {

    return _isOn;
}

const bool DbncdMPBttn::getIsPressed() const {

    return _isPressed;
}

const bool DbncdMPBttn::getOutputsChange() const{

    return _outputsChange;
}

const TaskHandle_t DbncdMPBttn::getTaskToNotify() const{

    return _taskToNotifyHndl;
}

bool DbncdMPBttn::end(){
    bool result {false};
    BaseType_t tmrModResult {pdFAIL};

    if (_mpbPollTmrHndl){
   	 result = pause();
       if (result){
      	 tmrModResult = xTimerStop(_mpbPollTmrHndl, portMAX_DELAY);
      	 if (tmrModResult == pdPASS){
      		 tmrModResult = xTimerDelete(_mpbPollTmrHndl, portMAX_DELAY);
      		 if (tmrModResult == pdPASS){
      			 _mpbPollTmrHndl = NULL;
      		 }
      		 else{
      			 result = false;
      		 }
      	 }
			 else{
				 result = false;
			 }
       }
    }

    return result;
}

bool DbncdMPBttn::init(GPIO_TypeDef* mpbttnPort, const uint16_t &mpbttnPin, const bool &pulledUp, const bool &typeNO, const unsigned long int &dbncTimeOrigSett){
    char mpbttnPinChar[3]{};
    int tmpBitCount{0};
    uint16_t tmpPinNum {_mpbttnPin};
    bool result {false};

    if (_mpbPollTmrName[0] == '\0'){
        _mpbttnPin = mpbttnPin;
        _pulledUp = pulledUp;
        _typeNO = typeNO;
        _dbncTimeOrigSett = dbncTimeOrigSett;

        tmpPinNum = tmpPinNum >> 1;
        while(tmpPinNum > 0){
       	 tmpPinNum = tmpPinNum >> 1;
       	 ++tmpBitCount;
        }
        sprintf(mpbttnPinChar, "%02u", tmpBitCount);
        strcpy(_mpbPollTmrName, "PollMpbPin");
        if(mpbttnPort == GPIOA)
        	strcat(_mpbPollTmrName, "A");
        else if(mpbttnPort == GPIOB)
        	strcat(_mpbPollTmrName, "B");
        else if(mpbttnPort == GPIOC)
        	strcat(_mpbPollTmrName, "C");
        else if(mpbttnPort == GPIOD)
        	strcat(_mpbPollTmrName, "D");
        else if(mpbttnPort == GPIOE)
        	strcat(_mpbPollTmrName, "E");
#ifdef GPIOF
			else if(mpbttnPort == GPIOF)	//Port not present in all STM32 MCUs/DevBoards
				strcat(_mpbPollTmrName, "F");
#endif
#ifdef GPIOG
			else if(mpbttnPort == GPIOG)	//Port not present in all STM32 MCUs/DevBoards
				strcat(_mpbPollTmrName, "G");
#endif
#ifdef GPIOH
			else if(mpbttnPort == GPIOH)	//Port not present in all STM32 MCUs/DevBoards
				strcat(_mpbPollTmrName, "H");
#endif
#ifdef GPIOI
			else if(mpbttnPort == GPIOI)	//Port not present in all STM32 MCUs/DevBoards
				strcat(_mpbPollTmrName, "I");
#endif

        if(_dbncTimeOrigSett < _stdMinDbncTime) 	// Best practice would impose failing the constructor (throwing an exeption or building a "zombie" object)
            _dbncTimeOrigSett = _stdMinDbncTime;    //this tolerant approach taken for developers benefit, but object will be no faithful to the instantiation parameters
        _dbncTimeTempSett = _dbncTimeOrigSett;

