GabyGold67/ButtonToSwitch_STM32/src/mpbToSwitchSTM32.cpp
bool TmLtchMPBttn::updIsPressed(){

    return DbncdMPBttn::updIsPressed();
}

bool TmLtchMPBttn::updValidPressPend(){

    return LtchMPBttn::updValidPressPend();
}

bool TmLtchMPBttn::updUnlatchPend(){
    if(_isOn){
        if (((xTaskGetTickCount() / portTICK_RATE_MS) - _srvcTimerStrt) >= _srvcTime){
            _unlatchPending = true;
            _validPressPend = false;
        }
    }

    return _unlatchPending;
}

void TmLtchMPBttn::mpbPollCallback(TimerHandle_t mpbTmrCbArg){
    TmLtchMPBttn* mpbObj = (TmLtchMPBttn*)pvTimerGetTimerID(mpbTmrCbArg);
    mpbObj->updIsPressed();
    mpbObj->updValidPressPend();
    mpbObj->updUnlatchPend();
    mpbObj->updIsOn();
    if (mpbObj->getOutputsChange()){
        if(mpbObj->getTaskToNotify() != NULL)
            xTaskNotifyGive(mpbObj->getTaskToNotify());
        mpbObj->setOutputsChange(false);
    }

    return;
}

//=========================================================================> Class methods delimiter
HntdTmLtchMPBttn::HntdTmLtchMPBttn(GPIO_TypeDef* mpbttnPort, const uint16_t &mpbttnPin, const unsigned long int &srvcTime, const unsigned int &wrnngPrctg, const bool &pulledUp, const bool &typeNO, const unsigned long int &dbncTimeOrigSett, const unsigned long int &strtDelay)
:TmLtchMPBttn(mpbttnPort, mpbttnPin, srvcTime, pulledUp, typeNO, dbncTimeOrigSett, strtDelay), _wrnngPrctg{wrnngPrctg}
{
	_wrnngMs = (_srvcTime * _wrnngPrctg) / 100;
}

bool HntdTmLtchMPBttn::begin(const unsigned long int &pollDelayMs){
   bool result {false};
   BaseType_t tmrModResult {pdFAIL};

   if (pollDelayMs > 0){
		if (!_mpbPollTmrHndl){
			_mpbPollTmrHndl = xTimerCreate(
				_mpbPollTmrName,  //Timer name
				pdMS_TO_TICKS(pollDelayMs),  //Timer period in ticks
				pdTRUE,     //Auto-reload true
				this,       //TimerID: data passed to the callback function to work
				HntdTmLtchMPBttn::mpbPollCallback
			);
			if (_mpbPollTmrHndl != NULL){
				tmrModResult = xTimerStart(_mpbPollTmrHndl, portMAX_DELAY);
				if (tmrModResult == pdPASS)
					result = true;
			}
		}
   }

   return result;
}

const bool HntdTmLtchMPBttn::getPilotOn() const{

    return _pilotOn;
}

const bool HntdTmLtchMPBttn::getWrnngOn() const{

    return _wrnngOn;
}

bool HntdTmLtchMPBttn::setSrvcTime(const unsigned long int &newSrvcTime){
    bool result {true};

    if (newSrvcTime != _srvcTime){
        result = TmLtchMPBttn::setSrvcTime(newSrvcTime);
        if (result)
            _wrnngMs = (_srvcTime * _wrnngPrctg) / 100;  //If the _srvcTime was changed, the _wrnngMs must be updated as it's a percentage of the first
    }

    return result;
}

bool HntdTmLtchMPBttn::setKeepPilot(const bool &newKeepPilot){
    if(_keepPilot != newKeepPilot)
        _keepPilot = newKeepPilot;

    return _keepPilot;
}

bool HntdTmLtchMPBttn::updIsOn() {

    return TmLtchMPBttn::updIsOn() ;
}

bool HntdTmLtchMPBttn::updIsPressed(){

    return DbncdMPBttn::updIsPressed();
}

bool HntdTmLtchMPBttn::updPilotOn(){
	if (_keepPilot){
		if(!_isOn && !_pilotOn){
			_pilotOn = true;
			_outputsChange = true;
		}
		else if(_isOn && _pilotOn){
			_pilotOn = false;
			_outputsChange = true;
		}
	}
	else{
		if(_pilotOn){
			_pilotOn = false;
			_outputsChange = true;
		}
	}

	return _pilotOn;
}

bool HntdTmLtchMPBttn::updUnlatchPend(){

	return TmLtchMPBttn::updUnlatchPend();
}

bool HntdTmLtchMPBttn::updValidPressPend(){

	return LtchMPBttn::updValidPressPend();
}

bool HntdTmLtchMPBttn::updWrnngOn(){
	if(_wrnngPrctg > 0){
		if (_isOn){
			if (((xTaskGetTickCount() / portTICK_RATE_MS) - _srvcTimerStrt) >= (_srvcTime - _wrnngMs)){
				if(_wrnngOn == false){
					_wrnngOn = true;
					_outputsChange = true;
				}
			}
			else if(_wrnngOn == true){
				_wrnngOn = false;
				_outputsChange = true;
			}
		}
		else if(_wrnngOn == true){
			_wrnngOn = false;
			_outputsChange = true;
		}
	}

	return _wrnngOn;
}

void HntdTmLtchMPBttn::mpbPollCallback(TimerHandle_t mpbTmrCbArg){
	HntdTmLtchMPBttn* mpbObj = (HntdTmLtchMPBttn*)pvTimerGetTimerID(mpbTmrCbArg);
	mpbObj->updIsPressed();
	mpbObj->updValidPressPend();
	mpbObj->updUnlatchPend();
	mpbObj->updIsOn();
	mpbObj->updWrnngOn();
	mpbObj->updPilotOn();
	if (mpbObj->getOutputsChange()){
		if(mpbObj->getTaskToNotify() != NULL)
			xTaskNotifyGive(mpbObj->getTaskToNotify());
		mpbObj->setOutputsChange(false);
	}

	return;
}

//=========================================================================> Class methods delimiter

XtrnUnltchMPBttn::XtrnUnltchMPBttn(GPIO_TypeDef* mpbttnPort, const uint16_t &mpbttnPin, GPIO_TypeDef* unltchPort, const uint16_t &unltchPin,
        const bool &pulledUp,  const bool &typeNO,  const unsigned long int &dbncTimeOrigSett,  const unsigned long int &strtDelay,
        const bool &upulledUp, const bool &utypeNO, const unsigned long int &udbncTimeOrigSett, const unsigned long int &ustrtDelay)
:LtchMPBttn(mpbttnPort, mpbttnPin, pulledUp, typeNO, dbncTimeOrigSett, strtDelay)
{
   _unLtchBttn = new DbncdDlydMPBttn(unltchPort, unltchPin, upulledUp, utypeNO, udbncTimeOrigSett, ustrtDelay);

}

XtrnUnltchMPBttn::XtrnUnltchMPBttn(GPIO_TypeDef* mpbttnPort, const uint16_t &mpbttnPin,  DbncdDlydMPBttn* unLtchBttn,
        const bool &pulledUp,  const bool &typeNO,  const unsigned long int &dbncTimeOrigSett,  const unsigned long int &strtDelay)
:LtchMPBttn(mpbttnPort, mpbttnPin, pulledUp, typeNO, dbncTimeOrigSett, strtDelay), _unLtchBttn{unLtchBttn}
{

}
XtrnUnltchMPBttn::XtrnUnltchMPBttn(GPIO_TypeDef* mpbttnPort, const uint16_t &mpbttnPin,
        const bool &pulledUp,  const bool &typeNO,  const unsigned long int &dbncTimeOrigSett,  const unsigned long int &strtDelay)
:LtchMPBttn(mpbttnPort, mpbttnPin, pulledUp, typeNO, dbncTimeOrigSett, strtDelay)
{

}

bool XtrnUnltchMPBttn::unlatch(){
    if(_isOn){
        _unlatchPending = false;
        _validPressPend = false;
        _isOn = false;
        _outputsChange = true;
    }

   return _isOn;
}

bool XtrnUnltchMPBttn::begin(const unsigned long int &pollDelayMs){
   bool result {false};
   BaseType_t tmrModResult {pdFAIL};

   if (pollDelayMs > 0){
		if (!_mpbPollTmrHndl){
			_mpbPollTmrHndl = xTimerCreate(
				_mpbPollTmrName,  //Timer name
				pdMS_TO_TICKS(pollDelayMs),  //Timer period in ticks
				pdTRUE,     //Auto-reload true
				this,       //TimerID: data passed to the callback function to work
				XtrnUnltchMPBttn::mpbPollCallback
			);
		}
		if (_mpbPollTmrHndl != NULL){
			tmrModResult = xTimerStart(_mpbPollTmrHndl, portMAX_DELAY);
			if (tmrModResult == pdPASS)
				result = _unLtchBttn->begin();
		}
   }

   return result;
}

bool XtrnUnltchMPBttn::updIsOn(){
   if (_unlatchPending){
      if (_isOn){
         _isOn = false;
         _outputsChange = true;
      }
      _unlatchPending = false;
      _validPressPend = false;
   }
   else if (_validPressPend){
      if (!_isOn){
         _isOn = true;
         _outputsChange = true;
      }
      _validPressPend = false;
      _unlatchPending = false;
   }

    return _isOn;
}

