GabyGold67/ButtonToSwitch_STM32/src/mpbToSwitchSTM32.cpp
bool XtrnUnltchMPBttn::updUnlatchPend(){
	bool result{false};

	if(_isOn){
		if (_unLtchBttn->getIsOn()){
			setUnlatchPend();
			result = true;
		}
	}

	return result;
}

void XtrnUnltchMPBttn::mpbPollCallback(TimerHandle_t mpbTmrCbArg){
	XtrnUnltchMPBttn* mpbObj = (XtrnUnltchMPBttn*)pvTimerGetTimerID(mpbTmrCbArg);
	mpbObj->updIsPressed();
	mpbObj->updValidPressPend();
	mpbObj->updUnlatchPend();
	mpbObj->updIsOn();
	if (mpbObj->getOutputsChange()){
		if(mpbObj->getTaskToNotify() != NULL)
			xTaskNotifyGive(mpbObj->getTaskToNotify());
		mpbObj->setOutputsChange(false);
	}

    return;
}

//=========================================================================> Class methods delimiter
VdblMPBttn::VdblMPBttn(GPIO_TypeDef* mpbttnPort, const uint16_t &mpbttnPin, const bool &pulledUp, const bool &typeNO, const unsigned long int &dbncTimeOrigSett, const unsigned long int &strtDelay, const bool &isOnDisabled)
:DbncdDlydMPBttn(mpbttnPort, mpbttnPin, pulledUp, typeNO, dbncTimeOrigSett, strtDelay), _isOnDisabled{isOnDisabled}
{
}

VdblMPBttn::~VdblMPBttn(){
}

void VdblMPBttn::clrStatus(){
    /*To Resume operation after a pause() without risking generating false "Valid presses" and "On" situations,
    several attributes must be resetted to "Start" values
    */
    DbncdMPBttn::clrStatus();
    setIsVoided(false);
    _outputsChange = true;

    return;
}

const bool VdblMPBttn::getIsEnabled() const{

    return _isEnabled;
}

const bool VdblMPBttn::getIsOnDisabled() const{

    return _isOnDisabled;
}

const bool VdblMPBttn::getIsVoided() const{

    return _isVoided;
}

bool VdblMPBttn::setIsEnabled(const bool &newEnabledValue){
    if(_isEnabled != newEnabledValue){
        if (!newEnabledValue){  //Changed to !Enabled (i.e. Disabled)
            pause();    //It's pausing the timer that keeps the inputs updated and calculates and updates the output flags... Flags must be updated for the disabled condition
            clrStatus();
            if(_isOnDisabled){  //Set the _isOn flag to expected value
                if(_isOn == false)
                    _isOn = true;
            }
            else{
                if (_isOn == true)
                    _isOn = false;
            }
            if(getTaskToNotify() != nullptr)
                xTaskNotifyGive(getTaskToNotify());
            setOutputsChange(false);
        }
        else{
            clrStatus();
            resume();   //It's resuming the timer that keeps the inputs updated and calculates and updates the output flags... before this some conditions of timers and flags had to be insured
        }
        _isEnabled = newEnabledValue;
        _outputsChange = true;
    }

    return _isEnabled;
}

bool VdblMPBttn::setIsOnDisabled(const bool &newIsOnDisabled){
    if(_isOnDisabled != newIsOnDisabled){
        _isOnDisabled = newIsOnDisabled;
        if(!_isEnabled){
            if(_isOn != _isOnDisabled){
                _isOn = _isOnDisabled;
                _outputsChange = true;
            }
        }
    }

    return _isOnDisabled;
}

bool VdblMPBttn::setIsVoided(const bool &newVoidValue){
    if(_isVoided != newVoidValue){
        _isVoided = newVoidValue;
        _outputsChange = true;
    }

    return _isVoided;
}

bool VdblMPBttn::enable(){

    return setIsEnabled(true);
}

bool VdblMPBttn::disable(){

    return setIsEnabled(false);
}

//=========================================================================> Class methods delimiter

TmVdblMPBttn::TmVdblMPBttn(GPIO_TypeDef* mpbttnPort, const uint16_t &mpbttnPin, unsigned long int voidTime, const bool &pulledUp, const bool &typeNO, const unsigned long int &dbncTimeOrigSett, const unsigned long int &strtDelay, const bool &isOnDisabled)
:VdblMPBttn(mpbttnPort, mpbttnPin, pulledUp, typeNO, dbncTimeOrigSett, strtDelay, isOnDisabled), _voidTime{voidTime}
{
}

TmVdblMPBttn::~TmVdblMPBttn(){
}

bool TmVdblMPBttn::begin(const unsigned long int &pollDelayMs){
    if (!_mpbPollTmrHndl){
        _mpbPollTmrHndl = xTimerCreate(
            _mpbPollTmrName,  //Timer name
            pdMS_TO_TICKS(pollDelayMs),  //Timer period in ticks
            pdTRUE,     //Autoreload true
            this,       //TimerID: data passed to the callback funtion to work
            TmVdblMPBttn::mpbPollCallback);
        assert (_mpbPollTmrHndl);
    }
    xTimerStart(_mpbPollTmrHndl, portMAX_DELAY);

    return _mpbPollTmrHndl != nullptr;
}

void TmVdblMPBttn::clrStatus(){
    /*To Resume operation after a pause() without risking generating false "Valid presses" and "On" situations,
    several attributes must be resetted to "Start" values
    */

    VdblMPBttn::clrStatus();
    _voidTmrStrt = 0;

    _outputsChange = true;
    return;
}

const unsigned long int TmVdblMPBttn::getVoidTime() const{

    return _voidTime;
}

bool TmVdblMPBttn::setIsEnabled(const bool &newEnabledValue){
    if(_isEnabled != newEnabledValue){
        VdblMPBttn::setIsEnabled(newEnabledValue);

        if (newEnabledValue){  //Changed to Enabled
            clrStatus();
            setIsVoided(true);  //For safety reasons if the mpb was disabled and re-enabled, it is set as voided, so if it was pressed when is was re-enabled there's no risk
                                // of activating somethin unexpectedly. It'll have to be released and then pressed back to intentionally set it to ON.
            resume();   //It's resuming the timer that keeps the inputs updated and calculates and updates the output flags... before this some conditions of timers and flags had to be insured
        }
        _isEnabled = newEnabledValue;
        _outputsChange = true;
    }

    return _isEnabled;
}

bool TmVdblMPBttn::setIsVoided(const bool &newVoidValue){
    if(newVoidValue){
        _voidTmrStrt = (xTaskGetTickCount() / portTICK_RATE_MS) - (_voidTime + 1);
    }
    if(_isVoided != newVoidValue){
        _outputsChange = true;
        _isVoided = newVoidValue;
    }

    return _isVoided;
}

bool TmVdblMPBttn::setVoidTime(const unsigned long int &newVoidTime){
    bool result{false};

    if(newVoidTime > 0){
        _voidTime = newVoidTime;
        result = true;
    }

    return result;
}

